sorosaulong-ux/gd32-test-project/Library/gd32a7xx_pmu.h
/*!
    \file    gd32a7xx_pmu.h
    \brief   definitions for the PMU
    
    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_PMU_H
#define GD32A7XX_PMU_H

#include "gd32a7xx.h"

/* PMU definitions */
#define PMU                           PMU_BASE                      /*!< PMU base address */

/* registers definitions */
#define PMU_LVCS                      REG32((PMU) + 0x00000000U)    /*!< PMU low voltage control and status register */
#define PMU_CFG                       REG32((PMU) + 0x00000004U)    /*!< PMU configuration register */
#define PMU_ABCTL                     REG32((PMU) + 0x00000008U)    /*!< PMU analog BIST control register */
#define PMU_ABSTAT                    REG32((PMU) + 0x0000000CU)    /*!< PMU analog BIST status register */
#define PMU_VID                       REG32((PMU) + 0x00000020U)    /*!< PMU version ID register */
#define PMU_CTLKEY                    REG32((PMU) + 0x00000024U)    /*!< PMU control key register */
#define PMU_MODCFG                    REG32((PMU) + 0x00000028U)    /*!< PMU mode configure register */
#define PMU_MODUPD                    REG32((PMU) + 0x0000002CU)    /*!< PMU mode update register */
#define PMU_MODSTAT                   REG32((PMU) + 0x00000030U)    /*!< PMU mode status register */
#define PMU_C0BTADDR                  REG32((PMU) + 0x00000034U)    /*!< PMU core 0 boot address register */
#define PMU_C1BTADDR                  REG32((PMU) + 0x00000038U)    /*!< PMU core 1 boot address register */
#define PMU_MCID                      REG32((PMU) + 0x0000003CU)    /*!< PMU core ID register */
#define PMU_CUPD                      REG32((PMU) + 0x00000040U)    /*!< PMU core update register */
#define PMU_CTL                       REG32((PMU) + 0x00000048U)    /*!< PMU control register */
#define PMU_TMRERREN                  REG32((PMU) + 0x00000054U)    /*!< PMU TMR error enable register */
#define PMU_TMRERRIF                  REG32((PMU) + 0x00000058U)    /*!< PMU TMR error interrupt register */
#define PMU_TMRERRIFC                 REG32((PMU) + 0x0000005CU)    /*!< PMU TMR error interrupt clear register */

/* bits definitions */
/* PMU_LVCS */
#define PMU_LVCS_VAHVDF               BIT(0)                        /*!< VDDA domain HVD flag on in NCM */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define PMU_LVCS_VBHVDF               BIT(1)                        /*!< VDDB domain HVD flag on in NCM */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define PMU_LVCS_V25HVDF              BIT(2)                        /*!< V25 domain HVD flag on in NCM */
#define PMU_LVCS_V11HVDF              BIT(3)                        /*!< V11 domain HVD flag on in NCM */
#define PMU_LVCS_V5ALVDF              BIT(4)                        /*!< VDDA domain 5V LVD flag on in NCM */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define PMU_LVCS_V15LVDF              BIT(5)                        /*!< V15 domain LVD flag on in NCM */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define PMU_LVCS_TMP0F                BIT(6)                        /*!< temperature monitor 0 interrupt flag */
#define PMU_LVCS_TMP1F                BIT(7)                        /*!< temperature monitor 1 interrupt flag */
#define PMU_LVCS_VAHVDSTAT            BIT(8)                        /*!< VDDA domain HVD status on in NCM */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define PMU_LVCS_VBHVDSTAT            BIT(9)                        /*!< VDDB domain HVD status on in NCM */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define PMU_LVCS_V25HVDSTAT           BIT(10)                       /*!< V25 domain HVD status on in NCM */
#define PMU_LVCS_V11HVDSTAT           BIT(11)                       /*!< V11 domain HVD status on in NCM */
#define PMU_LVCS_V5ALVDSTAT           BIT(12)                       /*!< VDDA domain 5V LVD status in NCM */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define PMU_LVCS_V15LVDSTAT           BIT(13)                       /*!< V15 domain LVD status in NCM */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define PMU_LVCS_TPM0O                BIT(14)                       /*!< temperature monitor 0 output */
#define PMU_LVCS_TPM1O                BIT(15)                       /*!< temperature monitor 1 output */
#define PMU_LVCS_VALVRNF              BIT(16)                       /*!< VDDA domain Low voltage reset flag in NCM */
#define PMU_LVCS_VALVRNLF             BIT(17)                       /*!< VDDA domain Low voltage reset flag (NCM or LCM) */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define PMU_LVCS_VBLVRNF              BIT(18)                       /*!< VDDB domain Low voltage reset flag in NCM */
#define PMU_LVCS_VBLVRNLF             BIT(19)                       /*!< VDDB domain Low voltage reset flag (NCM or LCM) */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define PMU_LVCS_V25LVRNF             BIT(20)                       /*!< V25 domain Low voltage reset flag in NCM */
#define PMU_LVCS_V25LVRNLF            BIT(21)                       /*!< V25 domain Low voltage reset flag (NCM or LCM) */
#define PMU_LVCS_V11LVRNF             BIT(22)                       /*!< V11 domain Low voltage reset flag in NCM */
#define PMU_LVCS_V11LVRNLF            BIT(23)                       /*!< V11 domain Low voltage reset flag (NCM or LCM) */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define PMU_LVCS_V15HVDF              BIT(26)                       /*!< 1.5V domain HVD flag on in NCM */
#define PMU_LVCS_V15HVDSTAT           BIT(27)                       /*!< 1.5V domain HVD status in NCM */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define PMU_LVCS_IRC48MSTB            BIT(28)                       /*!< IRC48M stabilization status */
#define PMU_LVCS_IRC40KSTB            BIT(29)                       /*!< IRC40K stabilization status */
#define PMU_LVCS_PORF                 BIT(31)                       /*!< POR flag */

/* PMU_CFG */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define PMU_CFG_FSREN                 BIT(0)                        /*!< final step regulator enable */
#define PMU_CFG_FSRCTLEN              BIT(1)                        /*!< final step regulator base control enable bit */
#define PMU_CFG_FREC                  BIT(2)                        /*!< fast recovery from LPM enable bit */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define PMU_CFG_V25LVRDEN             BIT(3)                        /*!< V25 domain LVR detection enable bit during LCM */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define PMU_CFG_VBLVRDEN              BIT(4)                        /*!< VDDB LVR detection enable bit during LCM */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define PMU_CFG_TMPIE                 BIT(7)                        /*!< temperature detect interrupt enable */
#define PMU_CFG_HVDIE                 BIT(8)                        /*!< high voltage detect interrupt enable */
#define PMU_CFG_LVDIE                 BIT(9)                        /*!< low voltage detects interrupt enable */
#define PMU_CFG_TEMP0EN               BIT(10)                       /*!< TEMP0 enable */
#define PMU_CFG_TEMP0SEL              BIT(11)                       /*!< high temperature monitoring level selection */
#define PMU_CFG_TEMP1EN               BIT(12)                       /*!< TEMP1 enable */
#define PMU_CFG_TEMP1SEL              BIT(13)                       /*!< high temperature monitoring level selection */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define PMU_CFG_FSRATO                BIT(16)                       /*!< final step regulator auto turn over bit */
#define PMU_CFG_FSRSTAT               BIT(17)                       /*!< final step regulator status bit */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define PMU_CFG_STBIRC48MCTL          BIT(19)                       /*!< control whether IRC48M is on in standby mode */
#define PMU_CFG_STBIRC40KCTL          BIT(20)                       /*!< control whether IRC40K is on in standby mode */
#define PMU_CFG_VALVRCTL              BIT(23)                       /*!< control VDDA LVR */

/* PMU_ABCTL */
#define PMU_ABCTL_ABEN                BIT(0)                        /*!< analog BIST enable signal */

