sorosaulong-ux/gd32-test-project/Library/gd32a7xx_pmu.h
/* PMU_ABSTAT */
#define PMU_ABSTAT_V11RUNAB           BIT(0)                        /*!< V11 RUN ABIST test status */
#define PMU_ABSTAT_V11STBAB           BIT(1)                        /*!< V11 STANDBY ABIST test status */
#define PMU_ABSTAT_V25AB              BIT(2)                        /*!< V25 BIST test status */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define PMU_ABSTAT_VBAB               BIT(3)                        /*!< VDDB BIST test status */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define PMU_ABSTAT_VAAB               BIT(4)                        /*!< VDDA BIST test status */
#define PMU_ABSTAT_TEMP0AB            BIT(5)                        /*!< high temperature 0 ABIST */
#define PMU_ABSTAT_TEMP1AB            BIT(6)                        /*!< high temperature 1 ABIST */
#define PMU_ABSTAT_HVDV11AB           BIT(8)                        /*!< HVD V11 ABIST test flag */
#define PMU_ABSTAT_HVDV25AB           BIT(9)                        /*!< HVD V25 ABIST test flag */
#define PMU_ABSTAT_HVDVAAB            BIT(10)                       /*!< HVD VDDA ABIST test flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define PMU_ABSTAT_HVDVBAB            BIT(11)                       /*!< HVD VDDB ABIST test flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* PMU_VID */
#define PMU_VID_FRA                   BIT(0)                        /*!< final step regulator availability */
#define PMU_VID_MAJVN                 BITS(28,31)                   /*!< major version number */

/* PMU_CTLKEY */
#define PMU_CTLKEY_CTLKEY             BITS(0,15)                    /*!< control key */

/* PMU_MODECFG */
#define PMU_MODCFG_SRSTR              BIT(0)                        /*!< system reset request */
#define PMU_MODCFG_SSRSTR             BIT(1)                        /*!< subsystem reset request */
#define PMU_MODCFG_STBR               BIT(15)                       /*!< standby request */

/* PMU_MODUPD */
#define PMU_MODUPD_MODUPD             BIT(0)                        /*!< mode update */

/* PMU_MODSTAT */
#define PMU_MODSTAT_PREMOD            BITS(0,1)                     /*!< previous mode */

/* PMU_C0BTADDR */
#define PMU_C0BTADDR_C0BTADDR         BITS(0,31)                    /*!< core 0 boot address */

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* PMU_C1BTADDR */
#define PMU_C1BTADDR_C1BTADDR         BITS(0,31)                    /*!< core 1 boot address */

/* PMU_MCID */
#define PMU_MCID_MCID                 BIT(0)                        /*!< main core ID */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* PMU_MODUPD */
#define PMU_CUPD_CUPD                 BIT(0)                        /*!< core update */

/* PMU_CTL */
#define PMU_CTL_BKPWEN                BIT(17)                       /*!< write protection enable for backup domain */

/* PMU_TMRERREN */
#define PMU_TMRERREN_HVDEN            BIT(0)                        /*!< HVD TMR error interrupt enable */
#define PMU_TMRERREN_LVDEN            BIT(1)                        /*!< LVD TMR error interrupt enable */
#define PMU_TMRERREN_TEMPEN           BIT(2)                        /*!< temperature interrupt enable */
#define PMU_TMRERREN_LVREN            BIT(3)                        /*!< LVR TMR error interrupt enable */
#define PMU_TMRERREN_PORFEN           BIT(4)                        /*!< PORF TMR error interrupt enable */
#define PMU_TMRERREN_FSREN            BIT(5)                        /*!< FSR interrupt enable */
#define PMU_TMRERREN_FSRCTLEN         BIT(6)                        /*!< FSRCTL interrupt enable */
#define PMU_TMRERREN_HVDIE            BIT(7)                        /*!< HVD interrupt enable */
#define PMU_TMRERREN_LVDIE            BIT(8)                        /*!< LVD interrupt enable */
#define PMU_TMRERREN_TEMPENEN         BIT(9)                        /*!< temperature enable interrupt enable */
#define PMU_TMRERREN_FSRATOEN         BIT(10)                       /*!< FSRATO interrupt enable */
#define PMU_TMRERREN_ABENEN           BIT(12)                       /*!< ABIST interrupt enable */
#define PMU_TMRERREN_ABEN             BIT(13)                       /*!< ABIST TMR error interrupt enable */
#define PMU_TMRERREN_TKEYEN           BIT(14)                       /*!< test key TMR error interrupt enable */
#define PMU_TMRERREN_MODUPDEN         BIT(15)                       /*!< mode update TMR error interrupt enable */
#define PMU_TMRERREN_CUPDEN           BIT(16)                       /*!< core update TMR error interrupt enable */

/* PMU_TMRERRIF */
#define PMU_TMRERRIF_HVDIF            BIT(0)                        /*!< HVD TMR error interrupt enable flag */
#define PMU_TMRERRIF_LVDIF            BIT(1)                        /*!< LVD TMR error interrupt enable flag */
#define PMU_TMRERRIF_TEMPIF           BIT(2)                        /*!< temperature interrupt enable flag */
#define PMU_TMRERRIF_LVRIF            BIT(3)                        /*!< LVR TMR error interrupt enable flag */
#define PMU_TMRERRIF_PORFIF           BIT(4)                        /*!< PORF TMR error interrupt enable flag */
#define PMU_TMRERRIF_FSRIF            BIT(5)                        /*!< FSR interrupt enable flag */
#define PMU_TMRERRIF_FSRCTLIF         BIT(6)                        /*!< FSRCTL interrupt enable flag */
#define PMU_TMRERRIF_HVDIEIF          BIT(7)                        /*!< HVD interrupt enable flag */
#define PMU_TMRERRIF_LVDIEIF          BIT(8)                        /*!< LVD interrupt enable flag */
#define PMU_TMRERRIF_TEMPENIF         BIT(9)                        /*!< temperature enable interrupt enable flag */
#define PMU_TMRERRIF_FSRATOIF         BIT(10)                       /*!< FSRATO interrupt enable flag */
#define PMU_TMRERRIF_ABENIF           BIT(12)                       /*!< ABIST interrupt enable flag */
#define PMU_TMRERRIF_ABIF             BIT(13)                       /*!< ABIST TMR error interrupt enable flag */
#define PMU_TMRERRIF_TKEYIF           BIT(14)                       /*!< test key TMR error interrupt enable flag */
#define PMU_TMRERRIF_MODUPDIF         BIT(15)                       /*!< mode update TMR error interrupt enable flag */
#define PMU_TMRERRIF_CUPDIF           BIT(16)                       /*!< core update TMR error interrupt enable flag */

/* PMU_TMRERRIFC */
#define PMU_TMRERRIFC_HVDIFC          BIT(0)                        /*!< HVD TMR error interrupt enable flag clear */
#define PMU_TMRERRIFC_LVDIFC          BIT(1)                        /*!< LVD TMR error interrupt enable flag clear */
#define PMU_TMRERRIFC_TEMPIFC         BIT(2)                        /*!< temperature interrupt enable flag clear */
#define PMU_TMRERRIFC_LVRIFC          BIT(3)                        /*!< LVR TMR error interrupt enable flag clear */
#define PMU_TMRERRIFC_PORFIFC         BIT(4)                        /*!< PORF TMR error interrupt enable flag clear */
#define PMU_TMRERRIFC_FSRIFC          BIT(5)                        /*!< FSR interrupt enable flag clear */
#define PMU_TMRERRIFC_FSRCTLIFC       BIT(6)                        /*!< FSRCTL interrupt enable flag clear */
#define PMU_TMRERRIFC_HVDIEIFC        BIT(7)                        /*!< HVD interrupt enable flag clear */
#define PMU_TMRERRIFC_LVDIEIFC        BIT(8)                        /*!< LVD interrupt enable flag clear */
#define PMU_TMRERRIFC_TEMPENIFC       BIT(9)                        /*!< temperature enable interrupt enable flag clear */
#define PMU_TMRERRIFC_FSRATOIFC       BIT(10)                       /*!< FSRATO interrupt enable flag clear */
#define PMU_TMRERRIFC_ABENIFC         BIT(12)                       /*!< ABIST interrupt enable flag clear */
#define PMU_TMRERRIFC_ABIFC           BIT(13)                       /*!< ABIST TMR error interrupt enable flag clear */
#define PMU_TMRERRIFC_TKEYIFC         BIT(14)                       /*!< test key TMR error interrupt enable flag clear */
#define PMU_TMRERRIFC_MODUPDIFC       BIT(15)                       /*!< mode update TMR error interrupt enable flag clear */
#define PMU_TMRERRIFC_CUPDIFC         BIT(16)                       /*!< core update TMR error interrupt enable flag clear */

/* constants definitions */
/* PMU voltage domain */
#define PMU_V25_DOMAIN                ((uint32_t)0x00000000U)       /*!< V25 domain */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define PMU_VDDB_DOMAIN               ((uint32_t)0x00000001U)       /*!< VDDB domain */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

