sorosaulong-ux/gd32-test-project/Library/gd32a7xx_pmu.h
/* PMU temperature monitor */
#define PMU_TEMPERATURE_MONITOR_0     ((uint32_t)0x00000000U)       /*!< temperature monitor 0 */
#define PMU_TEMPERATURE_MONITOR_1     ((uint32_t)0x00000001U)       /*!< temperature monitor 1 */

/* PMU temperature monitoring level */
#define PMU_TEMPERATURE_LEVEL_145     ((uint32_t)0x00000000U)       /*!< temperature threshold around 145 */
#define PMU_TEMPERATURE_LEVEL_155     ((uint32_t)0x00000001U)       /*!< temperature threshold around 155 */

/* PMU standby mode clock source */
#define PMU_CLK_IRC48M                ((uint32_t)0x00000000U)       /*!< clock source IRC48M */
#define PMU_CLK_IRC40K                ((uint32_t)0x00000001U)       /*!< clock source IRC40K */

/* PMU command constants definitions */
#define WFI_CMD                       ((uint8_t)0x00U)              /*!< use WFI command */
#define WFE_CMD                       ((uint8_t)0x01U)              /*!< use WFE command */

/* PMU control key value */
#define PMU_CTL_KEY_VLE               ((uint32_t)0x00005AF0U)       /*!< control key value */

/* PMU core no select */
#define PMU_CORE_ID_0                 ((uint32_t)0x00000000U)       /*!< select core 0 */
#define PMU_CORE_ID_1                 ((uint32_t)0x00000001U)       /*!< select core 1 */

/* PMU previous mode */
#define PMU_PRE_MODE_RESET            ((uint32_t)0x00000000U)       /*!< previous mode was reset (any reset) */
#define PMU_PRE_MODE_STANDBY          ((uint32_t)0x00000001U)       /*!< previous mode was standby mode */

/* define the PMU bit position and its register index offset */
#define PMU_REGIDX_BIT(regidx, bitpos) (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos))
#define PMU_REG_VAL(offset)            (REG32(PMU + ((uint32_t)(offset) >> 6U)))
#define PMU_BIT_POS(val)               ((uint32_t)(val) & 0x0000001FU)

/* register offset */
#define LVCS_REG_OFFSET                ((uint32_t)0x00000000U)                            /*!< LVCS register offset */
#define CFG_REG_OFFSET                 ((uint32_t)0x00000004U)                            /*!< CFG register offset */
#define ABSTAT_REG_OFFSET              ((uint32_t)0x0000000CU)                            /*!< ABSTAT register offset */

/* PMU interrupt enable or disable */
#define PMU_INT_HVD                    PMU_CFG_HVDIE                                      /*!< high voltage detect interrupt enable */
#define PMU_INT_LVD                    PMU_CFG_LVDIE                                      /*!< low voltage detect interrupt enable */
#define PMU_INT_TMP                    PMU_CFG_TMPIE                                      /*!< temperature monitor detect interrupt enable */

/* PMU interrupt flag */
#define PMU_INT_FLAG_VAHVD             PMU_LVCS_VAHVDF                                    /*!< VDDA domain HVD interrupt flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define PMU_INT_FLAG_VBHVD             PMU_LVCS_VBHVDF                                    /*!< VDDB domain HVD interrupt flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define PMU_INT_FLAG_V25HVD            PMU_LVCS_V25HVDF                                   /*!< V25 domain HVD interrupt flag */
#define PMU_INT_FLAG_V11HVD            PMU_LVCS_V11HVDF                                   /*!< V11 domain HVD interrupt flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define PMU_INT_FLAG_V15HVD            PMU_LVCS_V15HVDF                                   /*!< V15 domain HVD interrupt flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define PMU_INT_FLAG_V5ALVD            PMU_LVCS_V5ALVDF                                   /*!< VDDA domain 5V LVD interrupt flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define PMU_INT_FLAG_V15LVD            PMU_LVCS_V15LVDF                                   /*!< V15 domain LVD interrupt flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define PMU_INT_FLAG_TMP0              PMU_LVCS_TMP0F                                     /*!< temperature monitor 0 interrupt flag */
#define PMU_INT_FLAG_TMP1              PMU_LVCS_TMP1F                                     /*!< temperature monitor 1 interrupt flag */

/* PMU flags */  
typedef enum {
    /* flags in LVCS register */
    PMU_FLAG_VAHVDF                 = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 0U),                /*!< VDDA domain HVD flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    PMU_FLAG_VBHVDF                 = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 1U),                /*!< VDDB domain HVD flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    PMU_FLAG_V25HVDF                = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 2U),                /*!< V25 domain HVD flag */
    PMU_FLAG_V11HVDF                = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 3U),                /*!< V11 domain HVD flag */
    PMU_FLAG_V5ALVDF                = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 4U),                /*!< VDDA domain 5V LVD flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    PMU_FLAG_V15LVDF                = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 5U),                /*!< V15 domain LVD flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    PMU_FLAG_TMP0IF                 = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 6U),                /*!< temperature monitor 0 interrupt flag */
    PMU_FLAG_TMP1IF                 = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 7U),                /*!< temperature monitor 1 interrupt flag */
    PMU_FLAG_VAHVDSF                = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 8U),                /*!< VDDA domain HVD status flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    PMU_FLAG_VBHVDSF                = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 9U),                /*!< VDDB domain HVD status  flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    PMU_FLAG_V25HVDSF               = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 10U),               /*!< V25 domain HVD status flag */
    PMU_FLAG_V11HVDSF               = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 11U),               /*!< V11 domain HVD status flag */
    PMU_FLAG_V5ALVDSF               = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 12U),               /*!< VDDA domain 5V LVD status flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    PMU_FLAG_V15LVDSF               = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 13U),               /*!< V15 domain LVD status flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    PMU_FLAG_TPM0OF                 = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 14U),               /*!< temperature monitor 0 output flag */
    PMU_FLAG_TPM1OF                 = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 15U),               /*!< temperature monitor 1 output flag */
    PMU_FLAG_VALVRNF                = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 16U),               /*!< VDDA domain LVR NCM flag */
    PMU_FLAG_VALVRNLF               = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 17U),               /*!< VDDA domain LVR NCM or LCM flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    PMU_FLAG_VBLVRNF                = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 18U),               /*!< VDDB domain LVR NCM flag */
    PMU_FLAG_VBLVRNLF               = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 19U),               /*!< VDDB domain LVR NCM or LCM flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    PMU_FLAG_V25LVRNF               = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 20U),               /*!< V25 domain LVR NCM flag */
    PMU_FLAG_V25LVRNLF              = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 21U),               /*!< V25 domain LVR NCM or LCM flag */
    PMU_FLAG_V11LVRNF               = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 22U),               /*!< V11 domain LVR NCM flag */
    PMU_FLAG_V11LVRNLF              = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 23U),               /*!< V11 domain LVR NCM or LCM flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    PMU_FLAG_V15HVDF                = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 26U),               /*!< V15 domain HVD flag */
    PMU_FLAG_V15HVDSF               = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 27U),               /*!< V15 domain HVD status flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    PMU_FLAG_IRC48MSTBF             = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 28U),               /*!< IRC48M stabilization status flag */
    PMU_FLAG_IRC40KSTBF             = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 29U),               /*!< IRC40K stabilization status flag */
    PMU_FLAG_PORF                   = PMU_REGIDX_BIT(LVCS_REG_OFFSET, 31U),               /*!< POR flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    /* flag in CFG register */
    PMU_FLAG_FSRSF                  = PMU_REGIDX_BIT(CFG_REG_OFFSET, 17U),                /*!< final step regulator status flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    /* flags in ABSTAT register */
    PMU_FLAG_V11RUNABF              = PMU_REGIDX_BIT(ABSTAT_REG_OFFSET, 0U),              /*!< V11 RUN ABIST test flag */
    PMU_FLAG_V11STBABF              = PMU_REGIDX_BIT(ABSTAT_REG_OFFSET, 1U),              /*!< V11 STANDBY ABIST test flag */
    PMU_FLAG_V25ABF                 = PMU_REGIDX_BIT(ABSTAT_REG_OFFSET, 2U),              /*!< V25 BIST test flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    PMU_FLAG_VBABF                  = PMU_REGIDX_BIT(ABSTAT_REG_OFFSET, 3U),              /*!< VDDB BIST test flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    PMU_FLAG_VAABF                  = PMU_REGIDX_BIT(ABSTAT_REG_OFFSET, 4U),              /*!< VDDA BIST test flag */
    PMU_FLAG_TEMP0ABF               = PMU_REGIDX_BIT(ABSTAT_REG_OFFSET, 5U),              /*!< high temperature 0 flag */
    PMU_FLAG_TEMP1ABF               = PMU_REGIDX_BIT(ABSTAT_REG_OFFSET, 6U),              /*!< high temperature 1 flag */
    PMU_FLAG_HVDV11ABF              = PMU_REGIDX_BIT(ABSTAT_REG_OFFSET, 8U),              /*!< HVD V11 ABIST test flag */
    PMU_FLAG_HVDV25ABF              = PMU_REGIDX_BIT(ABSTAT_REG_OFFSET, 9U),              /*!< HVD V25 ABIST test flag */
    PMU_FLAG_HVDVAABF               = PMU_REGIDX_BIT(ABSTAT_REG_OFFSET, 10U),             /*!< HVD VDDA ABIST test flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    PMU_FLAG_HVDVBABF               = PMU_REGIDX_BIT(ABSTAT_REG_OFFSET, 11U),             /*!< HVD VDDB ABIST test flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
} pmu_flag_enum;

