sorosaulong-ux/gd32-test-project/Library/gd32a7xx_pmu.h
#ifdef FW_DEBUG_ERR_REPORT
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_PMU_DOMAIN(pmu_domain) (((pmu_domain) != PMU_V25_DOMAIN) && ((pmu_domain) != PMU_VDDB_DOMAIN)) 
#else
#define NOT_PMU_DOMAIN(pmu_domain) ((pmu_domain) != PMU_V25_DOMAIN) 
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define NOT_PMU_TEMPERATURE_MONITOR(temp_monitor) (((temp_monitor) != PMU_TEMPERATURE_MONITOR_0) && ((temp_monitor) != PMU_TEMPERATURE_MONITOR_1)) 
#define NOT_PMU_TEMPERATURE_LEVEL(temp_level) (((temp_level) != PMU_TEMPERATURE_LEVEL_145) && ((temp_level) != PMU_TEMPERATURE_LEVEL_155)) 
#define NOT_PMU_CLK_SOURCE(clk_src) (((clk_src) != PMU_CLK_IRC48M) && ((clk_src) != PMU_CLK_IRC40K))
#define NOT_CONTROL_STATUS(state) (((state) != ENABLE) && ((state) != DISABLE)) 
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_CORE_ID(core_id) (((core_id) != PMU_CORE_ID_0) && ((core_id) != PMU_CORE_ID_1)) 
#else
#define NOT_CORE_ID(core_id) ((core_id) != PMU_CORE_ID_0) 
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#define NOT_BOOT_ADDR(boot_addr) (((boot_addr) >= 0U) && ((boot_addr) <= 0xFFFFFFFFU)) 
#define NOT_SLEEPMODE_CMD(sleepmode_cmd) (((sleepmode_cmd) != WFI_CMD) && ((sleepmode_cmd) != WFE_CMD)) 

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_PMU_INTERRUPT(int_flag) (((int_flag) != PMU_INT_FLAG_VAHVD) && ((int_flag) != PMU_INT_FLAG_V25HVD) && ((int_flag) != PMU_INT_FLAG_V11HVD) && \
                                     ((int_flag) != PMU_INT_FLAG_V15LVD) && ((int_flag) != PMU_INT_FLAG_V15HVD) && ((int_flag) != PMU_INT_FLAG_VBHVD) && \
                                     ((int_flag) != PMU_INT_FLAG_V5ALVD) && ((int_flag) != PMU_INT_FLAG_TMP0) && ((int_flag) != PMU_INT_FLAG_TMP1))
#else
#define NOT_PMU_INTERRUPT(int_flag) (((int_flag) != PMU_INT_FLAG_VAHVD) && ((int_flag) != PMU_INT_FLAG_V25HVD) && ((int_flag) != PMU_INT_FLAG_V11HVD) && \
                                     ((int_flag) != PMU_INT_FLAG_V5ALVD)  && ((int_flag) != PMU_INT_FLAG_TMP0) && ((int_flag) != PMU_INT_FLAG_TMP1))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define NOT_PMU_INTERRUPT_ENABLE(interrupt) (((interrupt) != PMU_INT_HVD) && ((interrupt) != PMU_INT_LVD)&& ((interrupt) != PMU_INT_TMP))
#endif

/* function declarations */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* enable final step regulator */
void pmu_run_ldo_enable(void);
/* disable final step regulator */
void pmu_run_ldo_disable(void);
/* enable final step regulator auto truns over */
void pmu_run_ldo_auto_switch_enable(void);
/* disable final step regulator auto truns over */
void pmu_run_ldo_auto_switch_disable(void);
/* enable final step regulator base control */
void pmu_base_control_enable(void);
/* disable final step regulator base control */
void pmu_base_control_disable(void);
/* disable final step regulator and final step regulator base control simultaneously */
void pmu_run_ldo_and_base_control_disable(void);
/* enable fast recovery from LCM */
void pmu_fast_recovery_enable(void);
/* disable fast recovery from LCM */
void pmu_fast_recovery_disable(void);
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
/* enable PMU LVD */
void pmu_lvd_enable(uint32_t pmu_domain);
/* disable PMU LVD */
void pmu_lvd_disable(uint32_t pmu_domain);
/* enable temperature monitor */
void pmu_temperature_monitor_enable(uint32_t temp_monitor);
/* disable temperature monitor */
void pmu_temperature_monitor_disable(uint32_t temp_monitor);
/* select temperature monitor threshold */
void pmu_temperature_level_select(uint32_t temp_monitor, uint32_t temp_level);
/* set clock state when enter standby mode*/
void pmu_standby_clock_state_set(uint32_t clk_src, ControlStatus state);

/* start PMU analog BIST */
void pmu_analog_bist_start(void);
/* write PMU control key */
void pmu_control_key_write(void);
/* enable PMU mode update */
void pmu_mode_update_enable(void);
/* request system reset */
void pmu_system_reset_request(void);
/* request subsystem reset */
void pmu_subsystem_reset_request(void);
/* set PMU core boot address */
void pmu_core_boot_address_set(uint32_t core_id, uint32_t boot_addr);
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* set PMU main core id */
void pmu_main_core_id_set(uint32_t core_id);
/* get PMU main core id */
uint32_t pmu_main_core_id_get(void);
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
/* enable PMU core update */
void pmu_core_update_enable(void);

/* set PMU mode */
/* PMU work in standby mode */
void pmu_to_standbymode(void);
/* get previous mode */
uint32_t pmu_previous_mode_get(void);

/* backup related functions */
/* enable write access to the registers in backup domain */
void pmu_backup_write_enable(void);
/* disable write access to the registers in backup domain */
void pmu_backup_write_disable(void);

/* interrupt and flag functions */
/* clear all LVCS register flags */
void pmu_all_flags_clear(void);
/* get PMU flag */
FlagStatus pmu_flag_get(pmu_flag_enum flag);
/* clear PMU flag */
void pmu_flag_clear(pmu_flag_enum flag);
/* get PMU interrupt flag */
FlagStatus pmu_interrupt_flag_get(uint32_t int_flag);
/* clear PMU interrupt flag */
void pmu_interrupt_flag_clear(uint32_t int_flag);
/* enable the PMU interrupt */
void pmu_interrupt_enable(uint32_t interrupt);
/* disable the PMU interrupt */
void pmu_interrupt_disable(uint32_t interrupt);

#endif /* GD32A7XX_PMU_H */
